[
    {
        "title": "Learning-D4: Blog Posting GUI (FINALLY!!😭😭)",
        "date": "2024-07-25",
        "tags": [
            "Dev",
            " Problem Solving",
            "Learning Journey"
        ],
        "postcontent": "Day 4<br>Today, I paused studying data to solve an arising problem. Why? Because I'm really frustrated about it😤😤.<br>Since I started writing the blog, I thought I only needed to spend 30 minutes to an hour each day to brainstorm and write.<br>And the result is... 3 hours 😂 (yesterday).<br>And why? Look at the picture below (you'll understand immediately):<br><img src='../images/pastpost.png' id='inpost-img' alt='Past Post'><br>Yes sir, I've been manually writting all these HTML tags (those <...> things).<br><br><b>*Notes:</b> For those who don't know, to display things like line breaks, bold text, and bullet points on the web, it's not automatic; it's thanks to those <...> tags. If you don't add them, when it appears on the web, it will be all clumped together, looking like this:<br><img src='../images/pastpost2.png' id='inpost-img' alt='Past Post 2'><br><br>And hand-coding all those tags really takes A LOT OF TIME, and you have to test constantly to see if the formatting is correct (it's really exhausting).<br><br>So today I thought that's enough and I'm sick of it; I need to make an app to help solve this issue, and I made it today (technically, it's a GUI - Graphical User Interface).<br>Basically, it looks like this:<br><img src='../images/nowpost_en.png' id='inpost-img' alt='Posting GUI'><br>With this, I just need to fill in the content, add tags using the available widget buttons, choose the file I want to save into, and click 'Submit' - and all done, awesome!!<br>As for the JSON file at the top, it's the file where I save the post (like writing and saving in Word).<br><br>Let's get to an example for a better understanding; How about making today's post by this GUI:<br><img src='../images/nowpost2_en.png' id='inpost-img' alt='Posting GUI Example'><br><b>*Important Note:</b> I don't know much about creating GUIs, especially like this, so I used AI to help (GitHub Copilot, it's amazing). Of course, the AI output isn't perfect (or maybe I haven't figured out the right prompts 😂), so I still had to read and manually adjust some things to ensure the GUI works exactly how I want.<br><br>New things I used: Python Tkinter (Library), Regex (Regular Expression - if possible, I'll write a post about this topic, it's quite interesting), OOP (Object-oriented Programming - a nightmare for many 😂).<br><br>That's all I learned today.<br>Stay heated! Thanks for coming here!<br>"
    },
    {
        "title": "Learning-D3: R Basics: Data types",
        "postcontent": "Day 3<br>Today I started the 7th course (over 8) to earn the Google Data Analytics Professional Certificate: Data Analysis with R Programming. This is also my first time working with R.<br>Since it's the first day, I learned some basics (perfect for those new to programming).<br><br>  <b>1. Variables, Data Types, Vector, and List</b><br>  R has 4 basic data types:<ul><li><b>Character:</b> stores character strings. Remember to write them in quotes. ('a', 'b', 'Kay')</li><li><b>Double:</b> stores real numbers. (1.5, 2.5, 19.5)</li><li><b>Integer:</b> stores whole numbers. (1, 2, 30)</li><li><b>Logical:</b> stores TRUE or FALSE.</li></ul><br><b>*Notes:</b> Double and Integer have different declaration methods; I'll show you when creating a Vector.<br>  These variable types can form a Vector or a List.<br>  Getting confused already😵‍💫😵‍💫? So what are Vector and List?<br>  <b>Vector:</b> is a collection of elements. There are 2 types of vectors: <b>Atomic Vector</b> and <b>List</b>.<br><ul><li><b>Atomic Vector (let's just call it vector for simplicity):</b> containing elements of the same type. There are 4 types of atomic vectors: Character, Double, Integer, and Logical.<br><img src='../images/demovector.png' id='code-img' alt='Demo Vector'><br>To create a vector, we use c() as shown in the image and '<-' to assign the created value to a variable. To see what type the vector is, use typeof(variable_name). Note the difference between Double and Integer vectors. Integer must have 'L' after each number, otherwise R will auto interpret it as Double. Remember that!😁😁<br><br>So what if a vector contains multiple types of values? Check out this example:<br><img src='../images/demovector2.png' id='code-img' alt='Demo Vector 2'><br>This vector contains all 4 data types, so why is the result Character? Because if a vector contains multiple data types, R will follow a preset priority order: Character → Double → Integer → Logical (You don't need to remember this; you can Google it😉).<br><br>Next is naming the variables in the Vector (this is my first time seeing this approach, they don’t have it in other languages, or I haven’t know that yet🤔). Basically, it looks like this:<br><img src='../images/demovector3.png' id='code-img' alt='Demo Vector 3'><br>Here, the Vector values are (1, 2, 3), and 'a' will be the name of the variable with value 1, 'b' will be the name of the variable with value 2,...<br><br>There's another way to name them:<br><img src='../images/demovector4.png' id='code-img' alt='Demo Vector 4'><br>The vector already has values, then we direct the names to the variables using names(vector_name), and use another vector containing the variable names to apply them. You don't have to use both methods, just choose the one you like to avoid confusion!</li><li><b>List:</b> can contain multiple data types. To create it, we use list(elements) as shown below:<br><img src='../images/demolist.png' id='code-img' alt='Demo List'><br>We can also put a list INSIDE a list, called Nested List:<br><img src='../images/demolist2.png' id='code-img' alt='Demo List 2'><br>To view this list, we have 2 ways:<br><img src='../images/demolist3.png' id='code-img' alt='Demo List 3'><br><img src='../images/demolist4.png' id='code-img' alt='Demo List 4'><br>I prefer the first method because it's easier to read.<br><br>Naming is similar to Vector:<br><img src='../images/demolist5.png' id='code-img' alt='Demo List 5'><br></li></ul><b>2. Dates - Time</b><br>Next is about time and dates. Here we use functions available in the 'lubridate' library of 'tidyverse' (a larger library). But these need to be downloaded and loaded when you use them; here's how:<br><img src='../images/datetime.png' id='code-img' alt='Date Time'><br>Wait a bit for it to run; it needs to be downloaded. You only need to install once; from then on, you only need library() to load it. Experiment a bit:<br><img src='../images/datetime1.png' id='code-img' alt='Date Time 1'><br>today() is used to see today's date, and now() to see the current time.<br>To work with this data type, we first need to convert the input data to Date type because usually, we import data from somewhere, and R will recognize them as Character (default).<br><img src='../images/datetime2.png' id='code-img' alt='Date Time 2'><br>ymd, mdy, dmy,... are conversion functions. Initially, I thought it would be hard to remember😵‍💫. But it's actually super easy.<br><b>y: year, m: month, d: day</b><br>Example: ymd is year-month-day, mdy is month-day-year,...<br> The order doesn’t matter; as long as the values in the function are in the correct order, you're good to go.<br>If you don't arrange the order correctly, you'll get an error like this:<br><img src='../images/datetime3.png' id='code-img' alt='Date Time 3'><br>There can't be 24th month, right?😂😂.<br><b>*Notes:</b> In case you’re curious, ‘Date’ type data is understood by R as Double.<br><img src='../images/datetime4.png' id='code-img' alt='Date Time 4'><br>So far, it's only been dates, now let's add time.<br><img src='../images/datetime5.png' id='code-img' alt='Date Time 5'><br><b>h: hour, m: minute, s: second</b>Always remember that the values in the function must match its format.<br><b>*Notes:</b> If you don't specify the hour, minute, second, R will automatically assign 0 to them.<br><br>The problem is it's all UTC, even if you try to input another time zone, R will still understand it as UTC, like this:<br><img src='../images/datetime6.png' id='code-img' alt='Date Time 6'><br>To change the time zone, we need to add tz afterward:<br><img src='../images/datetime7.png' id='code-img' alt='Date Time 7'><br><br><b>3. Playing around</b>After learning the basics, I experimented a bit with a dataset available in R (actually, it comes with the library, just install it with install.package()).<br>This table contains data about penguins, and I created 3 charts that looks really great to me.<br><b>  a. Species count (easy)</b><br><img src='../images/penguin1.png' id='code-img' alt='Penguin 1'><br><b>  b. Body mass based on flipper length (by species) (intermediate)</b><br><img src='../images/penguin2.png' id='code-img' alt='Penguin 2'><br><b>  c. Distribution of body mass by species (challenging)</b><br><img src='../images/penguin3.png' id='code-img' alt='Penguin 3'><br>Making these charts and reading data from this table is really fun.<br>That's all I learned today.<br>Stay heated! Thanks for coming here!",
        "date": "2024-07-24",
        "tags": [
            "Data Visualization",
            "Learning Journey",
            "R",
            "Data Analysis"
        ]
    },
    {
        "title": "Learning-D2: Completed Data Visualization Course",
        "postcontent": "Day 2.<br>Today I continued the Data Visualization course that I started yesterday. Today mainly focused on basic Tableau and soft skills for presentations, so it was quite light.<br><br><b>Tableau:</b> Today I practiced and managed to create two dashboards as follows:<br><br>  #1: Happiness Index, GDP per capita, and Life Expectancy<br><img src='../images/happiness_dashboard.png' id='inpost-img' alt='Happiness Dashboard'><br>  Here I have a table on the left showing the happiness index (Happiness Score - HP Score) of countries from 2015-2017, followed by two charts displaying the correlation between HP Score - GDP per capita and HP Score - Life Expectancy.<br>  The line in the middle of the chart is a trendline showing the predicted relationship between the two variables (for those who don’t know, this is Linear Regression, used to predict the correlation between any two variables), and note that this line is only relative (so you may see that not all points lie on the trendline).<br><br>  #2: Average CO2 emissions of countries and regions.<br>  <img src='../images/CO2_dashboard.png' id='inpost-img' alt='CO2 Dashboard'><br>  In this dashboard, the top chart shows the average CO2 emissions of countries from 2015-2017, and the bottom chart shows the average CO2 emissions of regions from 1962-2012.<br>  It was meant to be fun, but it was actually quite enjoyable.😁😁😁<br><br><b>Soft Skills:</b> The job of a Data Analyst involves analyzing data + presenting it (which means giving presentations). So even if you are good at extracting insights from data, if you don’t know how to bring them to people, it’s still 'game over'.<br>Even though it’s still theoretical, this part was quite interesting and useful. In this section, what I found most valuable are two points:<br><br>  <b>#1: Aspects of Data Storytelling</b><ul><li><b>Characters:</b> The target audience you are aiming for when analyzing data (Customers, income, website visits,...). You can think of this as answering the 'Who' and 'What'</li><li><b>Setting:</b> The time + location of the data, answering 'Where' and 'When'. For example, the revenue data of a bubble tea chain in one year.</li><li><b>Plot:</b> The problem you want to solve when analyzing data, and this should be your focus. For example, should your company be concerned about the revenue and profit of a competitor? Or simply, is bubble tea bought more in the summer?</li><li><b>Big Reveal:</b> This is when you share the insights you’ve drawn with everyone. It should be something noteworthy and significant, otherwise, people won’t bother to listen.</li><li><b>Aha moment:</b> At this point, you will suggest the next steps people should take after understanding the insights you’ve drawn (how should the company adjust the quantity of imports based on time, for instance).</li></ul>  <b>#2: Pro-tips</b><ul><li>After showing the audience a chart, pause for about 5 seconds to let people process the chart first.</li><li>When presenting any chart to the audience at the beginning, remember to explain clearly what they need to know to read the chart. It’s even better if you ask, 'Does anyone not understand this chart?'</li><li>Each slide should contain less than 5 lines of text and a total of 25 words.</li><li>Always stay focused on the main topic. If someone asks something unrelated, try to direct them back to the main topic (and possibly arrange another session to share later).</li><li>If someone asks a question that you don’t know the answer to, be honest and ask for time to research, and also schedule a time to get back to them.</li></ul>That’s all I learned today.<br>Stay heated! Thanks for coming here today!",
        "date": "2024-07-23",
        "tags": [
            "Data Visualization",
            "Learning Journey",
            "Data Storytelling"
        ]
    },
    {
        "title": "Learning-D1: Web update + Data Visualization",
        "postcontent": "Today I've made some updates for this website after going through feedbacks.<br>Updates includes: Responsive resize for different screen size, Refine language option button.<br><br>Also, I've started the Data Visualization course from Google Data Analytics Certificate (which is the 6th out of 8 courses you have to complete to get the certificate).<br>Up until now, I've been thinking about visualizing data is a work of creativy, but there turns out to be more...<br>If you're creative and have lots of idea, that's a GREAT PLUS. However, I am not that creative and always struggling with what color to choose; do I have to follow a color palette, if so, which one to choose; is placing this chart here good; etc. (and I believe that there are many people like me). So there are many sets of rules that you can follow, and today I learnt the 'Design Thinking' concept, which has 5 steps: <ol><li><b>Empathize:</b> Consider target audience's needs and preferences for visualizing data</li><li><b>Define:</b>Finding out what the audience want to get from the data (i.e: what target are they focusing on). Ex: Whether temperature and ice cream sales are correlated?</li><li><b>Ideate:</b> Brainstroming how this visualization is going to be. Personally, I would recommend drawing your ideas out, no matter on paper, boards, or tablets, all will work just fine. The target is to let your ideas come out because you can't hold everything in your head. Just let them out and you'll finish this step faster comparing to not draw anything out.</li><li><b>Prototype:</b> Create the visualization! However, this one should be for giving to your folks to get feedbacks.</li><li><b>Test:</b> Show your prototype to people, and receive feedbacks</li></ol>But what after the 'Test' step? After going through all feedbacks, you should go back to step 3, recreate and refine your visualization until you get a nod from everyone.<br><br>I know it's going to take time, especially for people with not much creativity, but if you cannot catch up, you'll be left behind, and no one is going to feel sorry for you. It's like a test of whether you fit this field or not.<br><br>Stay heated! Thanks for coming here today!",
        "date": "2024-07-22",
        "tags": [
            "Data Visualization",
            "Desgin Thinking",
            "Learning Journey"
        ]
    },
    {
        "title": "A Great Start",
        "postcontent": "Welcome!<br><br>Just call me Kay or Kha, whichever is good for you.<br>I'm now a sophomore at an international university in Japan (well, we study everything in English here, so my Japanese is not that good). My major is a mixture between Business and IT, but not double degrees.<br><br>I'm starting this blog to document my journey in learning new things everyday (for now is Data Analytics), and also some random thoughts that come to my mind daily. Therefore, the content of posts can be varied greatly, but most of it will relate somehow to the Technological field.<br><br>I hope you enjoy reading my blog!",
        "date": "2024-07-22",
        "tags": [
            "Thoughts"
        ]
    }
]