[
  {
    "title": "Learning-D2: Completed Data Visualization Course",
    "postcontent": "Day 2.<br>Today I continued the Data Visualization course that I started yesterday. Today mainly focused on basic Tableau and soft skills for presentations, so it was quite light.<br><br><b>Tableau:</b> Today I practiced and managed to create two dashboards as follows:<br><br>  #1: Happiness Index, GDP per capita, and Life Expectancy<br><img src='../images/happiness_dashboard.png' id='inpost-img' alt='Happiness Dashboard'><br>  Here I have a table on the left showing the happiness index (Happiness Score - HP Score) of countries from 2015-2017, followed by two charts displaying the correlation between HP Score - GDP per capita and HP Score - Life Expectancy.<br>  The line in the middle of the chart is a trendline showing the predicted relationship between the two variables (for those who don’t know, this is Linear Regression, used to predict the correlation between any two variables), and note that this line is only relative (so you may see that not all points lie on the trendline).<br><br>  #2: Average CO2 emissions of countries and regions.<br>  <img src='../images/CO2_dashboard.png' id='inpost-img' alt='CO2 Dashboard'><br>  In this dashboard, the top chart shows the average CO2 emissions of countries from 2015-2017, and the bottom chart shows the average CO2 emissions of regions from 1962-2012.<br>  It was meant to be fun, but it was actually quite enjoyable.😁😁😁<br><br><b>Soft Skills:</b> The job of a Data Analyst involves analyzing data + presenting it (which means giving presentations). So even if you are good at extracting insights from data, if you don’t know how to bring them to people, it’s still 'game over'.<br>Even though it’s still theoretical, this part was quite interesting and useful. In this section, what I found most valuable are two points:<br><br>  <b>#1: Aspects of Data Storytelling</b><ul><li><b>Characters:</b> The target audience you are aiming for when analyzing data (Customers, income, website visits,...). You can think of this as answering the 'Who' and 'What'</li><li><b>Setting:</b> The time + location of the data, answering 'Where' and 'When'. For example, the revenue data of a bubble tea chain in one year.</li><li><b>Plot:</b> The problem you want to solve when analyzing data, and this should be your focus. For example, should your company be concerned about the revenue and profit of a competitor? Or simply, is bubble tea bought more in the summer?</li><li><b>Big Reveal:</b> This is when you share the insights you’ve drawn with everyone. It should be something noteworthy and significant, otherwise, people won’t bother to listen.</li><li><b>Aha moment:</b> At this point, you will suggest the next steps people should take after understanding the insights you’ve drawn (how should the company adjust the quantity of imports based on time, for instance).</li></ul>  <b>#2: Pro-tips</b><ul><li>After showing the audience a chart, pause for about 5 seconds to let people process the chart first.</li><li>When presenting any chart to the audience at the beginning, remember to explain clearly what they need to know to read the chart. It’s even better if you ask, 'Does anyone not understand this chart?'</li><li>Each slide should contain less than 5 lines of text and a total of 25 words.</li><li>Always stay focused on the main topic. If someone asks something unrelated, try to direct them back to the main topic (and possibly arrange another session to share later).</li><li>If someone asks a question that you don’t know the answer to, be honest and ask for time to research, and also schedule a time to get back to them.</li></ul>That’s all I learned today.<br>Stay heated! Thanks for coming here today!",
    "date": "2024-07-23",
    "tags": ["Data Visualization", "Learning Journey", "Data Storytelling"]
  },  
  {
    "title": "Learning-D1: Web update + Data Visualization",
    "postcontent": "Today I've made some updates for this website after going through feedbacks.<br>Updates includes: Responsive resize for different screen size, Refine language option button.<br><br>Also, I've started the Data Visualization course from Google Data Analytics Certificate (which is the 6th out of 8 courses you have to complete to get the certificate).<br>Up until now, I've been thinking about visualizing data is a work of creativy, but there turns out to be more...<br>If you're creative and have lots of idea, that's a GREAT PLUS. However, I am not that creative and always struggling with what color to choose; do I have to follow a color palette, if so, which one to choose; is placing this chart here good; etc. (and I believe that there are many people like me). So there are many sets of rules that you can follow, and today I learnt the 'Design Thinking' concept, which has 5 steps: <ol><li><b>Empathize:</b> Consider target audience's needs and preferences for visualizing data</li><li><b>Define:</b>Finding out what the audience want to get from the data (i.e: what target are they focusing on). Ex: Whether temperature and ice cream sales are correlated?</li><li><b>Ideate:</b> Brainstroming how this visualization is going to be. Personally, I would recommend drawing your ideas out, no matter on paper, boards, or tablets, all will work just fine. The target is to let your ideas come out because you can't hold everything in your head. Just let them out and you'll finish this step faster comparing to not draw anything out.</li><li><b>Prototype:</b> Create the visualization! However, this one should be for giving to your folks to get feedbacks.</li><li><b>Test:</b> Show your prototype to people, and receive feedbacks</li></ol>But what after the 'Test' step? After going through all feedbacks, you should go back to step 3, recreate and refine your visualization until you get a nod from everyone.<br><br>I know it's going to take time, especially for people with not much creativity, but if you cannot catch up, you'll be left behind, and no one is going to feel sorry for you. It's like a test of whether you fit this field or not.<br><br>Stay heated! Thanks for coming here today!",
    "date": "2024-07-22",
    "tags": ["Data Visualization", "Desgin Thinking", "Learning Journey"]
  },
  {
    "title": "A Great Start",
    "postcontent": "Welcome!<br><br>Just call me Kay or Kha, whichever is good for you.<br>I'm now a sophomore at an international university in Japan (well, we study everything in English here, so my Japanese is not that good). My major is a mixture between Business and IT, but not double degrees.<br><br>I'm starting this blog to document my journey in learning new things everyday (for now is Data Analytics), and also some random thoughts that come to my mind daily. Therefore, the content of posts can be varied greatly, but most of it will relate somehow to the Technological field.<br><br>I hope you enjoy reading my blog!",
    "date": "2024-07-22",
    "tags": ["Thoughts"]
  }
]